swiftat-itwfeg/UnifiedGTXproRT1024/bootloader/board/pin_mux.c
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v8.0
processor: MIMXRT1024xxxxx
package_id: MIMXRT1024DAG5A
mcu_data: ksdk2_0
processor_version: 0.0.0
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"     
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();

/* GPIO_AD_B1_00~GPIO_AD_B1_05 can only be configured as flexspi function. Note that it can't be modified here */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_00_FLEXSPI_A_DATA03,1U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_01_FLEXSPI_A_SCLK,1U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_02_FLEXSPI_A_DATA00,1U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_03_FLEXSPI_A_DATA02,1U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_04_FLEXSPI_A_DATA01,1U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_05_FLEXSPI_A_SS0_B,1U);
}

void BOARD_InitPins(void) {
    CLOCK_EnableClock( kCLOCK_Iomuxc );         
    CLOCK_EnableClock( kCLOCK_Xbar1 );

    CLOCK_EnableClock( kCLOCK_Lpspi1 ); 
    CLOCK_EnableClock( kCLOCK_Lpspi2 ); 
    CLOCK_EnableClock( kCLOCK_Lpspi3 ); 
    CLOCK_EnableClock( kCLOCK_Lpspi4 ); 
     
    /*set clock source for lpspi1*/
    CLOCK_SetMux( kCLOCK_LpspiMux, 1 );
    CLOCK_SetDiv( kCLOCK_LpspiDiv, 7 );
    
    /*set clock source for lpspi2 */
    CLOCK_SetMux(kCLOCK_LpspiMux, 2);
    CLOCK_SetDiv(kCLOCK_LpspiDiv, 4);
   
    CLOCK_EnableClock( kCLOCK_Adc1 );
    CLOCK_EnableClock( kCLOCK_Adc2 );

    
/******************************************************************************/    
/************************* rt1024-rockchip board ******************************/
/********************* sbc-rk3568-nxp24-ark rev 1.0 ***************************/
/******************************************************************************/        
    /* global board */
    gpio_pin_config_t outCfg, inCfg;
    
    outCfg.direction            = kGPIO_DigitalOutput;
    outCfg.outputLogic          = 1U;
    outCfg.interruptMode        = kGPIO_NoIntmode;
    
    inCfg.direction             = kGPIO_DigitalInput;    
    inCfg.interruptMode         = kGPIO_NoIntmode;
  
/***************************** rev 3 signals **********************************/
    //IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_29_FLEXPWM2_PWMB03, 0U ); //stepper enable PWM      

    /* printhead type pin, 80mm vs 72 */
    GPIO_PinInit( GPIO1, 15U, &inCfg );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_AD_B0_15_GPIO1_IO15, 0x70A0U );
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B0_15_GPIO1_IO15, 0U );                                    
    
    /* stepper current limit set A */
    GPIO_PinInit(GPIO3, 5U, &outCfg);
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_37_GPIO3_IO05, 0x70A0U );
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_37_GPIO3_IO05, 0U );  
    
    /* stepper current limit set B */
    GPIO_PinInit(GPIO3, 7U, &outCfg);
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_39_GPIO3_IO07, 0x70A0U ); 
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_39_GPIO3_IO07, 0U); 
    
    /* stepper enable */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_29_GPIO2_IO29, 0U);
    gpio_pin_config_t enableConfig = { kGPIO_DigitalOutput, 0 };
    GPIO_PinInit( MOTOR_EN_GPIO, MOTOR_EN_PIN, &enableConfig );
    
    /* IDF 1 and 2 */

    GPIO_PinInit(GPIO1, 7U, &inCfg);
    GPIO_PinInit(GPIO1, 8U, &inCfg);
    
    IOMUXC_SetPinConfig( IOMUXC_GPIO_AD_B0_07_GPIO1_IO07, 0x70A0U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_AD_B0_08_GPIO1_IO08, 0x70A0U );

    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_07_GPIO1_IO07, 0U);                                    
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_08_GPIO1_IO08, 0U); 
   
    
/*************************** print head signals *******************************/
#if 1
    /* print head lpspi4 clk group3 pin0 configured as lpspi4 clk */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_32_LPSPI4_SCK, 0U );
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_32_LPSPI4_SCK, 0x10B0U ); 

    /* print head lpspi4 mosi group3 pin3 configured as lpspi4 mosi ***** miso / mosi switch on schematic! ***** */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_34_LPSPI4_SDO, 0U );
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_34_LPSPI4_SDO, 0x10B0U ); 
    
    /* print head latch enable group2 pin1 configured as ouput 
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_01_GPIO2_IO01, 0U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_01_GPIO2_IO01, 0x70A0U ); 
    GPIO_PinInit( PHEAD_STROBE_EN_GPIO, PHEAD_STROBE_EN_PIN, &outCfg );
    */
    
    outCfg.outputLogic          = 1U;
    
    /* print head latch group2 pin0 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_00_GPIO2_IO00, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_00_GPIO2_IO00, 0x70A0U ); 
    GPIO_PinInit( PHEAD_LATCH_GPIO, PHEAD_LATCH_PIN, &outCfg );
    
    //outCfg.outputLogic          = 1U; //these strobe pins need to be muxed based on printhead type at some point
    
    outCfg.outputLogic          = 1U;
    
    /* print strobe a group3 pin6 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_38_GPIO3_IO06, 1U );                                                
    //IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_38_FLEXPWM2_PWMA00, 0x10B0U ); 
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_38_GPIO3_IO06, 0x70A0U ); 
    GPIO_PinInit( PHEAD_STROBE_A_GPIO, PHEAD_STROBE_A_PIN, &outCfg );

    /* print strobe b group3 pin22 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_SD_B1_02_GPIO3_IO22, 1U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B1_02_GPIO3_IO22, 0x70A0U ); 
    GPIO_PinInit( PHEAD_STROBE_B_GPIO, PHEAD_STROBE_B_PIN, &outCfg );
    
