swiftat-itwfeg/UnifiedGTXproRT1024/bootloader/board/pin_mux.c
    outCfg.outputLogic          = 0U;
    
    /* print power enable group2 pin4 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_04_GPIO2_IO04, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_04_GPIO2_IO04, 0x70A0U ); 
    GPIO_PinInit( PHEAD_POWER_EN_GPIO, PHEAD_POWER_EN_PIN, &outCfg );

    /* print head dot enable group2 pin5 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_05_GPIO2_IO05, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_05_GPIO2_IO05, 0x70A0U ); 
    GPIO_PinInit( PHEAD_DOT_ENABLE_GPIO, PHEAD_DOT_ENABLE_PIN, &outCfg );
    
    outCfg.outputLogic          = 1U;
 

#endif
/****************************** motor signals *********************************/
    
#if 1
    /* main motor sleep group3 pin4 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_36_GPIO3_IO04, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_36_GPIO3_IO04, 0x70A0U ); 
    GPIO_PinInit( MAIN_MOTOR_SLEEP_GPIO, MAIN_MOTOR_SLEEP_PIN, &outCfg );
    
    /* main motor ms0 group2 pin25 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_25_GPIO2_IO25, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_25_GPIO2_IO25, 0x70A0U );   
    GPIO_PinInit( MAIN_MOTOR_MS0_GPIO, MAIN_MOTOR_MS0_PIN, &outCfg );
    
    /* main motor ms1 group2 pin27 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_27_GPIO2_IO27, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_27_GPIO2_IO27, 0x70A0U ); 
    GPIO_PinInit( MAIN_MOTOR_MS1_GPIO, MAIN_MOTOR_MS1_PIN, &outCfg );

    /* main motor reset group2 pin28 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_28_GPIO2_IO28, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_28_GPIO2_IO28, 0x70A0U );
    GPIO_PinInit( MAIN_MOTOR_RESET_GPIO, MAIN_MOTOR_RESET_PIN, &outCfg );

    /* main motor enable group2 pin29 configured as ouput */
    //IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_29_GPIO2_IO29, 1U );                                                
    //IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_29_GPIO2_IO29, 0x70A0U );   
    //GPIO_PinInit( MOTOR_EN_GPIO, MOTOR_EN_PIN, &outCfg );

    //IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_29_GPIO2_IO29, 1U);
    //gpio_pin_config_t enableConfig = { kGPIO_DigitalOutput, 1, };
    //GPIO_PinInit( MOTOR_EN_GPIO, MOTOR_EN_PIN, &enableConfig );
    
    /* main motor direction group2 pin30 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_30_GPIO2_IO30, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_30_GPIO2_IO30, 0x70A0U );   
    GPIO_PinInit( MAIN_MOTOR_DIR_GPIO, MAIN_MOTOR_DIR_PIN, &outCfg );

    /* main motor step group2 pin31 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_31_GPIO2_IO31, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_31_GPIO2_IO31, 0x70A0U );       
    GPIO_PinInit( MAIN_MOTOR_STEP_GPIO, MAIN_MOTOR_STEP_PIN, &outCfg );

    
    /* takeup motor ms0 group2 pin16 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_16_GPIO2_IO16, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_16_GPIO2_IO16, 0x70A0U );
    GPIO_PinInit( TAKEUP_MOTOR_MS0_GPIO, TAKEUP_MOTOR_MS0_PIN, &outCfg );

    /* takeup motor ms1 group2 pin17 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_17_GPIO2_IO17, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_17_GPIO2_IO17, 0x70A0U ); 
    GPIO_PinInit( TAKEUP_MOTOR_MS1_GPIO, TAKEUP_MOTOR_MS1_PIN, &outCfg );

    /* takeup motor reset group2 pin18 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_18_GPIO2_IO18, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_18_GPIO2_IO18, 0x70A0U );
    GPIO_PinInit( TAKEUP_MOTOR_RESET_GPIO, TAKEUP_MOTOR_RESET_PIN, &outCfg );

    /* takeup motor enable group2 pin19 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_19_GPIO2_IO19, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_19_GPIO2_IO19, 0x70A0U );
    GPIO_PinInit( TAKEUP_MOTOR_EN_GPIO, TAKEUP_MOTOR_EN_PIN, &outCfg );

    /* takeup motor direction group2 pin20 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_20_GPIO2_IO20, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_20_GPIO2_IO20, 0x70A0U );
    GPIO_PinInit( TAKEUP_MOTOR_DIR_GPIO, TAKEUP_MOTOR_DIR_PIN, &outCfg );

    /* takeup motor step group2 pin21 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_21_GPIO2_IO21, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_21_GPIO2_IO21, 0x70A0U );
    GPIO_PinInit( TAKEUP_MOTOR_STEP_GPIO, TAKEUP_MOTOR_STEP_PIN, &outCfg );

    /* takeup motor sleep group2 pin24 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_24_GPIO2_IO24, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_24_GPIO2_IO24, 0x70A0U );
    GPIO_PinInit( TAKEUP_MOTOR_SLEEP_GPIO, TAKEUP_MOTOR_SLEEP_PIN, &outCfg );
    
#endif             
/****************************** misc signals **********************************/    
    
    IOMUXC_SetPinMux( IOMUXC_GPIO_SD_B1_05_FLEXSPI_A_DQS, 1U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B1_05_FLEXSPI_A_DQS, 0x10F1U );                           
    

    /* serial flash cs group3 pin16 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_SD_B0_03_GPIO3_IO16, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B0_03_GPIO3_IO16, 0x70A0U );
    GPIO_PinInit( SERIAL_FlASH_CS_GPIO, SERIAL_FlASH_CS_PIN, &outCfg );
    
    #ifdef RK3568_ARK_REV_1_0_MOD    
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_39_FLEXPWM2_PWMB00, 0U ); 
    #else 
    
