swiftat-itwfeg/UnifiedGTXproRT1024/bootloader/board/pin_mux.c
    #if 1   /* mine */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_09_XBAR1_INOUT09, 0U );                                                
    IOMUXC_GPR->GPR6 = ((IOMUXC_GPR->GPR6 &
      (~(IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_9_MASK))) 
        | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_9(0x01U) 
      );
    XBARA_SetSignalsConnection( XBARA, kXBARB2_InputQtimer1Tmr0, kXBARA1_OutputIomuxXbarInout09 ); 
    

    /* label taken led group2 pin9 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_09_XBAR1_INOUT09, 0U );                                                
    IOMUXC_GPR->GPR6 = ((IOMUXC_GPR->GPR6 &
      (~(IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_9_MASK))) 
        | IOMUXC_GPR_GPR6_IOMUXC_XBAR_DIR_SEL_9(0x01U) 
      );
    XBARA_SetSignalsConnection( XBARA, kXBARB2_InputQtimer1Tmr0, kXBARA1_OutputIomuxXbarInout09 ); 

    #else
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_09_GPIO2_IO09, 0U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_09_GPIO2_IO09, 0x70A0U );
    
    outCfg.outputLogic          = 0U;
    /* label taken enable group3 pin31 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_SD_B1_11_GPIO3_IO31, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B1_11_GPIO3_IO31, 0x1088U );
    GPIO_PinInit( LABEL_TAKEN_EN_GPIO, LABEL_TAKEN_EN_PIN, &outCfg );
    outCfg.outputLogic          = 1U;    
    #endif 
    
    outCfg.outputLogic          = 0U;
    /* label taken enable group3 pin31 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_SD_B1_11_GPIO3_IO31, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B1_11_GPIO3_IO31, 0x1088U );
    GPIO_PinInit( LABEL_TAKEN_EN_GPIO, LABEL_TAKEN_EN_PIN, &outCfg );
    outCfg.outputLogic          = 1U;
    #endif
    

    /* lp5521 enable group2 pin7 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_07_GPIO2_IO07, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_07_GPIO2_IO07, 0x70A0U ); //0xD0B0U
    GPIO_PinInit( LP5521_EN_GPIO, LP5521_EN_PIN, &outCfg );
    
    /* model a group3 pin17 configured as input */
    IOMUXC_SetPinMux( IOMUXC_GPIO_SD_B1_04_GPIO3_IO24, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B1_04_GPIO3_IO24, 0x70A0U );
    GPIO_PinInit( MODEL_TYPE_A_GPIO, MODEL_TYPE_A_PIN, &inCfg );

    /* model b group3 pin18 configured as input */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_08_GPIO2_IO08, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_08_GPIO2_IO08, 0x70A0U );
    GPIO_PinInit( MODEL_TYPE_B_GPIO, MODEL_TYPE_B_PIN, &inCfg );

    /* model c group3 pin19 configured as input */
    IOMUXC_SetPinMux( IOMUXC_GPIO_SD_B1_06_GPIO3_IO26, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B1_06_GPIO3_IO26, 0x70A0U );
    GPIO_PinInit( MODEL_TYPE_C_GPIO, MODEL_TYPE_C_PIN, &inCfg );

    /* model d group3 pin20 configured as input */
    IOMUXC_SetPinMux( IOMUXC_GPIO_SD_B1_07_GPIO3_IO27, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B1_07_GPIO3_IO27, 0x70A0U );
    GPIO_PinInit( MODEL_TYPE_D_GPIO, MODEL_TYPE_D_PIN, &inCfg );
  
    /* idf1 & 2 signals */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B0_08_GPIO1_IO08, 0U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_AD_B0_08_GPIO1_IO08, 0x70A0U );
    GPIO_PinInit( IDF1_GPIO, IDF1_PIN, &inCfg );
    
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B0_09_GPIO1_IO09, 0U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_AD_B0_09_GPIO1_IO09, 0x70A0U );
    GPIO_PinInit( IDF2_GPIO, IDF2_PIN, &inCfg );
    
    /* heart beat led group3 pin14 configured as output */
    IOMUXC_SetPinMux( IOMUXC_GPIO_SD_B0_01_GPIO3_IO14, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B0_01_GPIO3_IO14, 0x70A0U );
    GPIO_PinInit( HEART_BEAT_LED_GPIO, HEART_BEAT_LED_PIN, &outCfg );

    /* logo led enable */
    IOMUXC_SetPinMux( IOMUXC_GPIO_SD_B1_08_GPIO3_IO28, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B1_08_GPIO3_IO28, 0x70A0U );
    GPIO_PinInit( LOGO_EN_LED_GPIO, LOGO_EN_LED_PIN, &outCfg );
    
    /* logo2 led enable */
    IOMUXC_SetPinMux( IOMUXC_GPIO_SD_B1_09_GPIO3_IO29, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B1_09_GPIO3_IO29, 0x70A0U );
    GPIO_PinInit( LOGO_EN1_LED_GPIO, LOGO_EN1_LED_PIN, &outCfg );

    IOMUXC_SetPinMux( IOMUXC_GPIO_SD_B1_10_GPIO3_IO30, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B1_10_GPIO3_IO30, 0x70A0U );
    GPIO_PinInit( LOGO_STATUS_LED_EN_GPIO, LOGO_STATUS_LED_EN_PIN, &outCfg );


    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_06_GPIO1_IO22, 0U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B1_10_GPIO3_IO30, 0x70A0U );
    GPIO_PinInit( STATUS_LED_GPIO, STATUS_LED_PIN, &outCfg );

/*************************** interface signals ********************************/    
    
    /* sram cs group3 pin1 configured as output */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_33_GPIO3_IO01, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_33_GPIO3_IO01, 0x70A0U );
    GPIO_PinInit( SRAM_CS_GPIO, SRAM_CS_PIN, &outCfg );

    /* sram lpspi4 miso group3 pin1 configured as lpspi4 miso ***** miso / mosi switch on schematic! ***** */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_35_LPSPI4_SDI, 0U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_35_LPSPI4_SDI, 0x10B0U ); 
    
    /* serial flash lpspi1 clk group3 pin15 configured as lpspi1 clk */
    IOMUXC_SetPinMux( IOMUXC_GPIO_SD_B0_02_LPSPI1_SCK, 0U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B0_02_LPSPI1_SCK, 0x10B0U ); 
    
    /* serial flash lpspi1 miso group3 pin17 configured as lpspi1 miso */
    IOMUXC_SetPinMux( IOMUXC_GPIO_SD_B0_04_LPSPI1_SDO, 0U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B0_04_LPSPI1_SDO, 0x10B0U ); 
    
    /* serial flash lpspi1 mosi group3 pin18 configured as lpspi1 mosi */
    IOMUXC_SetPinMux( IOMUXC_GPIO_SD_B0_05_LPSPI1_SDI, 0U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B0_05_LPSPI1_SDI, 0x10B0U ); 
    
    /* weigher lpspi2 clk group2 pin10 configured as lpspi2 clk */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_10_LPSPI2_SCK, 0U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_10_LPSPI2_SCK, 0x10B0U ); 
    
