swiftat-itwfeg/UnifiedGTXproRT1024/bootloader/board/pin_mux.c
    /* weigher lpspi2 miso group2 pin12 configured as lpspi2 miso */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_12_LPSPI2_SDO, 0U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_12_LPSPI2_SDO, 0x10B0U ); 

   // IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_11_GPIO2_IO11, 0U );
   // IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_11_GPIO2_IO11, 0x70A0U ); 

    /* weigher lpspi2 mosi group2 pin13 configured as lpspi2 mosi */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_13_LPSPI2_SDI, 0U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_13_LPSPI2_SDI, 0x10B0U ); 
    
    
    
/***************************** comm signals ***********************************/    

    /* rs485 group1 pin10 configured as uart5 tx */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B0_10_LPUART5_TX, 0U );                                    
    IOMUXC_SetPinConfig( IOMUXC_GPIO_AD_B0_10_LPUART5_TX, 0x10B0U );                               

    /* rs485 group1 pin11 configured as uart5 rx */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B0_11_LPUART5_RX, 0U );                                    
    IOMUXC_SetPinConfig( IOMUXC_GPIO_AD_B0_11_LPUART5_RX, 0x10B0U ); 
#if 0
    
    /* can interface rx group3 pin21 configured as can rx */
    IOMUXC_SetPinMux( IOMUXC_GPIO_SD_B1_01_FLEXCAN1_RX, 0U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B1_01_FLEXCAN1_RX, 0x10B0U );

    /* can interface tx group3 pin20 configured as can tx */
    IOMUXC_SetPinMux( IOMUXC_GPIO_SD_B1_00_FLEXCAN1_TX, 0U );    
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B1_00_FLEXCAN1_TX, 0x10B0U ); 
    
#else 
    
    /* debug interface group3 pin21 configured as uart6 rx */
    IOMUXC_SetPinMux( IOMUXC_GPIO_SD_B1_01_LPUART6_RX, 0U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B1_01_LPUART6_RX, 0x10B0U );

    /* debug interface group3 pin20 configured as uart6 tx */
    IOMUXC_SetPinMux( IOMUXC_GPIO_SD_B1_00_LPUART6_TX, 0U );    
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B1_00_LPUART6_TX, 0x10B0U ); 

#endif    
    /* cutter group1 pin6 configured as uart1 tx */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B0_06_LPUART1_TX, 0U );                                    
    IOMUXC_SetPinConfig( IOMUXC_GPIO_AD_B0_06_LPUART1_TX, 0x10B0U ); 
    
    //IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_06_GPIO1_IO06, 0U); 
    //IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_06_GPIO1_IO06, 0x70A0U );  
    //GPIO_PinInit( GPIO1, 6U, &outCfg2 );  //debug pin for hung

    /* cutter group1 pin7 configured as uart1 rx */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B0_07_LPUART1_RX, 0U );                                    
    IOMUXC_SetPinConfig( IOMUXC_GPIO_AD_B0_07_LPUART1_RX, 0x10B0U );
   
    /* do not configure this output to enable the U3920 to switch the usb link! */
    /* usb pwr enable group3 pin9 configured as usb pwr 
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_41_USB_OTG1_PWR, 0U ); */   

    /* usb id group3 pin8 configured as usb id */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_40_USB_OTG1_ID, 0U );       

    /* debug group2 pin22 configured as uart2 tx */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_22_LPUART2_TX, 0U );                                    
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_22_LPUART2_TX, 0x10B0U );                               
    
    /* debug group2 pin23 configured as uart2 rx */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_23_LPUART2_RX, 0U );                                    
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_23_LPUART2_RX, 0x10B0U ); 

/***************************** sensor signals *********************************/    

    /* label taken group1 pin13 configured as input */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B0_13_GPIO1_IO13, 0U );                                                
    
    /* low label stock group1 pin14 configured as adc channel */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B0_14_GPIO1_IO14, 0U );                                    

    /* shoot through group1 pin23 configured as adc channel */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_07_GPIO1_IO23, 0U );                                    
    
    /* paper takeup group1 pin24 configured as adc channel */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_08_GPIO1_IO24, 0U );                                    

    /* print head temperature group1 pin25 configured as adc channel */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_09_GPIO1_IO25, 0U );                                    

    /* print head dot group1 pin27 configured as adc channel */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_11_GPIO1_IO27, 0U );                                    

    /* print head up group1 pin26 configured as input */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_10_GPIO1_IO26, 0U );     

    /* print head detection group1 pin15 configured as input */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B0_15_GPIO1_IO15, 0U );   
    
/***************************** weigher signals ********************************/

    /* ext weigher adc clk group2 pin26 configured as pwma0  */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_26_FLEXPWM1_PWMA00, 0U );                                    
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_26_FLEXPWM1_PWMA00, 0x10B0U );                                 
   
    /* ext weigher adc reset group3 pin5 configured as ouput */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_37_GPIO3_IO05, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_37_GPIO3_IO05, 0x70A0U );   
    GPIO_PinInit( WGR_RESET_GPIO, WGR_RESET_PIN, &outCfg );   
    
    /* weigher service switch group2 pin6 configured as input */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_06_GPIO2_IO06, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_06_GPIO2_IO06, 0x70A0U ); 
    inCfg.interruptMode         = kGPIO_IntFallingEdge;
    GPIO_PinInit( SERVICE_SWITCH_GPIO, SERVICE_SWITCH_PIN, &inCfg ); 
    
    /* weigher accelerometer int a group2 pin14 configured as input */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_14_GPIO2_IO14, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_14_GPIO2_IO14, 0x70A0U ); 
    outCfg.outputLogic          = 1U;   
    /*
    inCfg.interruptMode         = kGPIO_IntFallingEdge;
    GPIO_PinInit( ACCEL_INTA_GPIO, ACCEL_INTA_PIN, &inCfg ); 
    */
    GPIO_PinInit( ACCEL_INTA_GPIO, ACCEL_INTA_PIN, &outCfg ); 
    
    /* weigher accelerometer int b group2 pin15 configured as output */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_15_GPIO2_IO15, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_15_GPIO2_IO15, 0x70A0U );  
    
