swiftat-itwfeg/UnifiedGTXproRT1024/bootloader/board/pin_mux.c
    GPIO_PinInit( ACCEL_INTB_GPIO, ACCEL_INTB_PIN, &outCfg );       

    /* weigher accelerometer group2 pin2 configured as lpi2c clk */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_02_LPI2C1_SCL, 1U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_02_LPI2C1_SCL, 0xD8B0U );                       

    /* weigher accelerometer group2 pin3 configured as lpi2c sda */
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_03_LPI2C1_SDA, 1U );                            
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_03_LPI2C1_SDA, 0xD8B0U );                           

    /* weigher accelerometer group1 pin28 configured as lpspi3 clk */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_12_LPSPI3_SCK, 0U );
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_12_LPSPI3_SCK, 0x10B0U );    

    /* weigher accelerometer group1 pin30 configured as lpspi3 mosi */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_14_LPSPI3_SDO, 0U );
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_14_LPSPI3_SDO, 0x10B0U ); 
    
    /* weigher accelerometer group1 pin31 configured as lpspi3 miso */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_15_LPSPI3_SDI, 0U);    
    IOMUXC_SetPinConfig( IOMUXC_GPIO_AD_B1_15_LPSPI3_SDI, 0x10B0U );     
     
    /* weigher accelerometer spi cs a group1 pin29 configured as output */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_13_GPIO1_IO29, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_AD_B1_13_GPIO1_IO29, 0x70A0U );   
    GPIO_PinInit( ACCEL_SPI_CS_GPIO, ACCEL_SPI_CS_PIN, &outCfg ); 
    GPIO_WritePinOutput( ACCEL_SPI_CS_GPIO, ACCEL_SPI_CS_PIN, false );  //Low so serial EEP is not corrupted   

    /* weigher accelerometer pwr enable group3 pin24 configured as output */
    IOMUXC_SetPinMux( IOMUXC_GPIO_SD_B1_03_GPIO3_IO23, 0U );                                                
    IOMUXC_SetPinConfig( IOMUXC_GPIO_SD_B1_03_GPIO3_IO23, 0x70A0U );   
    GPIO_PinInit( ACCEL_PWR_EN_GPIO, ACCEL_PWR_EN_PIN, &outCfg ); 
    GPIO_WritePinOutput( ACCEL_PWR_EN_GPIO, ACCEL_PWR_EN_PIN, false );  //Turn off. Only turn on if VM enabled
    
    //LPSPI2 pins for CS5530
    //CS5530 SPI clk
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_10_LPSPI2_SCK, 0U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_10_LPSPI2_SCK, 0x10B0U );
  
    //CS5530 GPIO chip select
    gpio_pin_config_t csCfg; 
    csCfg.direction = kGPIO_DigitalOutput;
    csCfg.outputLogic = 0U;
    csCfg.interruptMode = kGPIO_NoIntmode;
    
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_11_GPIO2_IO11, 0U );                                    
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_11_GPIO2_IO11, 0x1030U ); 
    GPIO_PinInit(GPIO2, 11U, &csCfg);
  
    //CS5530 SPI SDO
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_12_LPSPI2_SDO, 0U );
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_12_LPSPI2_SDO, 0x10B0U );
  
    //CS5530 SPI SDI
    IOMUXC_SetPinMux( IOMUXC_GPIO_EMC_13_LPSPI2_SDI, 0U );                                    
    IOMUXC_SetPinConfig( IOMUXC_GPIO_EMC_13_LPSPI2_SDI, 0x10B0U );
      
/******************************************************************************/    
/******************************************************************************/    
/******************************************************************************/ 
}

/*! ****************************************************************************   
      \fn configurePinAD_B1_15AsSPI3MISO(void)
 
      \brief
        configure pin AD_B1_15 for SPI3 MISO function. This pin has to be 
        dynamically switched from SPI configuration to an Input to accomodate 
        weigher accelerometer serial EEP write and erase cycles.

      \author
          Tom Fink
*******************************************************************************/ 
void configurePinAD_B1_15AsSPI3MISO(void)
{   //GPIO_EMC_35
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_15_LPSPI3_SDI, 0U);    
    IOMUXC_SetPinConfig( IOMUXC_GPIO_AD_B1_15_LPSPI3_SDI, 0x10B0U ); 
}

/*! ****************************************************************************   
      \fn 
 
      \brief
        Configure pin AD_B1_15 as a GP Input. This pin has to be 
        dynamically switched from SPI configuration to an Input to accomodate 
        weigher accelerometer serial EEP write and erase cycles.

      \author
          Tom Fink
*******************************************************************************/ 
void configurePinAD_B1_15AsGPIO(void)
{
    gpio_pin_config_t inCfg;
    
    inCfg.direction             = kGPIO_DigitalInput;    
    inCfg.interruptMode         = kGPIO_NoIntmode;
   
    /* weigher accelerometer group1 pin31 configured as gpio out */
    IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_15_GPIO1_IO31, 0U );                                    
    IOMUXC_SetPinConfig( IOMUXC_GPIO_AD_B1_15_GPIO1_IO31, 0x0190B0U );
    GPIO_PinInit( ACCEL_SPI_MISO_GPIO, ACCEL_SPI_MISO_PIN, &inCfg );
}
